{
    
        "colleges": [
          {
            "name": "Indian Institute of Technology Delhi",
            "location": "IIT Delhi Main Rd, IIT Campus, Hauz Khas, New Delhi, Delhi 110016",
            "type": "Government",
            "ranking": 2,
            "description": "Indian Institute of Technology Delhi (more popularly known as IIT Delhi) is one of the most prestigious universities in India. IIT Delhi is ranked 2nd by the NIRF 2023 under the Engineering category, 1st by India Today 2023 under the Engineering category, and 1st by the India Today 2023 under the Engineering (Government) category. IIT Delhi is popular for its flagship programmes, i.e. MTech and BTech courses. IITD was established in 1961 as the College of Engineering. Later, it was declared the Institution of National Importance under the Institutes of Technology (Amendment) Act of 1963. Over the years, over 48,000 students have graduated from IIT Delhi in several disciplines including Physical Sciences, Engineering, Management, and Humanities and Social Sciences, and various other streams. Over 15,738 students have received their BTech degree from IIT Delhi over the years. Indian Institute of Technology Delhi (IIT Delhi), through various departments and schools of study, offers UG, PG, and various other courses to students. IIT Delhi is also ranked 150 internationally by the QS World University Rankings 2025. It is one of the twenty-three IITs present in India.",
            "imageUrl": "path/to/college-image1.jpg",
            "websiteUrl": "https://home.iitd.ac.in/"
        
      },
      
        {
            "name": "Example College Name 2",
            "location": "City, State",
            "type": "Private/Public",
            "ranking": 23,
            "description": "Brief description of the college.",
            "imageUrl": "path/to/college-image2.jpg",
            "websiteUrl": "https://www.examplecollege2.edu"
        }
    ],
    "footer": {
        "text": "© 2024 Your Website. All rights reserved.",
        "links": [
            {
                "label": "Privacy Policy",
                "url": "http://localhost:5173/privacy"
            },
            {
                "label": "Terms of Service",
                "url": "http://localhost:5173/terms"
            }
        ]
    }
}